{
  "<blank>": 0,
  "<unk>": 1,
  "SOS": 2,
  "EOS": 3,
  "N": 4,
  "a": 5,
  "b": 6,
  "ba": 7,
  "be": 8,
  "bi": 9,
  "bo": 10,
  "bu": 11,
  "by": 12,
  "bya": 13,
  "bye": 14,
  "byo": 15,
  "byu": 16,
  "ch": 17,
  "cha": 18,
  "che": 19,
  "chi": 20,
  "cho": 21,
  "chu": 22,
  "cl": 23,
  "d": 24,
  "da": 25,
  "de": 26,
  "di": 27,
  "do": 28,
  "du": 29,
  "dyu": 30,
  "e": 31,
  "f": 32,
  "fa": 33,
  "fe": 34,
  "fi": 35,
  "fo": 36,
  "fu": 37,
  "fyu": 38,
  "g": 39,
  "ga": 40,
  "ge": 41,
  "gi": 42,
  "go": 43,
  "gu": 44,
  "gya": 45,
  "gyo": 46,
  "gyu": 47,
  "h": 48,
  "ha": 49,
  "he": 50,
  "hi": 51,
  "ho": 52,
  "hu": 53,
  "hya": 54,
  "hyo": 55,
  "hyu": 56,
  "i": 57,
  "j": 58,
  "ja": 59,
  "je": 60,
  "ji": 61,
  "jo": 62,
  "ju": 63,
  "k": 64,
  "ka": 65,
  "ke": 66,
  "ki": 67,
  "ko": 68,
  "ku": 69,
  "ky": 70,
  "kya": 71,
  "kyo": 72,
  "kyu": 73,
  "m": 74,
  "ma": 75,
  "me": 76,
  "mi": 77,
  "mo": 78,
  "mu": 79,
  "my": 80,
  "mya": 81,
  "myo": 82,
  "myu": 83,
  "na": 84,
  "ne": 85,
  "ni": 86,
  "no": 87,
  "nu": 88,
  "ny": 89,
  "nya": 90,
  "nyo": 91,
  "nyu": 92,
  "o": 93,
  "p": 94,
  "pa": 95,
  "pe": 96,
  "pi": 97,
  "po": 98,
  "pu": 99,
  "pya": 100,
  "pye": 101,
  "pyo": 102,
  "pyu": 103,
  "r": 104,
  "ra": 105,
  "re": 106,
  "ri": 107,
  "ro": 108,
  "ru": 109,
  "ry": 110,
  "rya": 111,
  "ryo": 112,
  "ryu": 113,
  "s": 114,
  "sa": 115,
  "se": 116,
  "sh": 117,
  "sha": 118,
  "she": 119,
  "shi": 120,
  "sho": 121,
  "shu": 122,
  "si": 123,
  "so": 124,
  "su": 125,
  "t": 126,
  "ta": 127,
  "te": 128,
  "ti": 129,
  "to": 130,
  "tso": 131,
  "tsu": 132,
  "tu": 133,
  "ty": 134,
  "tya": 135,
  "u": 136,
  "v": 137,
  "va": 138,
  "ve": 139,
  "vi": 140,
  "vo": 141,
  "vu": 142,
  "w": 143,
  "wa": 144,
  "we": 145,
  "wi": 146,
  "wo": 147,
  "wu": 148,
  "y": 149,
  "ya": 150,
  "ye": 151,
  "yi": 152,
  "yo": 153,
  "yu": 154,
  "z": 155,
  "za": 156,
  "ze": 157,
  "zi": 158,
  "zo": 159,
  "zu": 160
}