{
    "non_lexical_phonemes": [
        "AP",
        "EP"
    ],
    "non_lexical_phonemes_dict": {
        "AP": 1,
        "EP": 2,
        "None": 0
    },
    "dictionaries": {
        "en": "ds_cmudict-07b.txt",
        "ja": "japanese_dict_full.txt",
        "zh": "ds-zh-pinyin-lite.txt"
    },
    "language_prefix": true,
    "merged_phoneme_groups": [
        [
            "",
            "GS",
            "AP",
            "cl",
            "CL",
            "EP",
            "pau",
            "SP",
            "<SP>"
        ]
    ],
    "silent_phonemes": [
        "",
        "GS",
        "AP",
        "cl",
        "CL",
        "EP",
        "pau",
        "SP",
        "<SP>"
    ],
    "vocab": {
        "": 0,
        "<SP>": 0,
        "AP": 0,
        "CL": 0,
        "EP": 0,
        "GS": 0,
        "SP": 0,
        "cl": 0,
        "en/_r": 1,
        "en/aa": 2,
        "en/ae": 3,
        "en/ah": 4,
        "en/ao": 5,
        "en/aw": 6,
        "en/ax": 7,
        "en/ay": 8,
        "en/b": 9,
        "en/ch": 10,
        "en/d": 11,
        "en/dh": 12,
        "en/dx": 13,
        "en/eh": 14,
        "en/er": 15,
        "en/ey": 16,
        "en/f": 17,
        "en/g": 18,
        "en/hh": 19,
        "en/ih": 20,
        "en/iy": 21,
        "en/jh": 22,
        "en/k": 23,
        "en/l": 24,
        "en/m": 25,
        "en/n": 26,
        "en/ng": 27,
        "en/ow": 28,
        "en/oy": 29,
        "en/p": 30,
        "en/r": 31,
        "en/s": 32,
        "en/sh": 33,
        "en/t": 34,
        "en/th": 35,
        "en/uh": 36,
        "en/uw": 37,
        "en/v": 38,
        "en/w": 39,
        "en/y": 40,
        "en/z": 41,
        "en/zh": 42,
        "ja/N": 43,
        "ja/a": 44,
        "ja/b": 45,
        "ja/by": 46,
        "ja/ch": 47,
        "ja/d": 48,
        "ja/dy": 49,
        "ja/e": 50,
        "ja/f": 51,
        "ja/g": 52,
        "ja/gw": 53,
        "ja/gy": 54,
        "ja/h": 55,
        "ja/hy": 56,
        "ja/i": 57,
        "ja/j": 58,
        "ja/k": 59,
        "ja/kw": 60,
        "ja/ky": 61,
        "ja/m": 62,
        "ja/my": 63,
        "ja/n": 64,
        "ja/ny": 65,
        "ja/o": 66,
        "ja/p": 67,
        "ja/py": 68,
        "ja/r": 69,
        "ja/ry": 70,
        "ja/s": 71,
        "ja/sh": 72,
        "ja/t": 73,
        "ja/ts": 74,
        "ja/ty": 75,
        "ja/u": 76,
        "ja/v": 77,
        "ja/w": 78,
        "ja/y": 79,
        "ja/z": 80,
        "ja/cl": 0,
        "ja/pau": 0,
        "ja/AP": 0,
        "ja/SP": 0,
        "pau": 0,
        "zh/a": 81,
        "zh/ai": 82,
        "zh/an": 83,
        "zh/ang": 84,
        "zh/ao": 85,
        "zh/b": 86,
        "zh/c": 87,
        "zh/ch": 88,
        "zh/d": 89,
        "zh/e": 90,
        "zh/ei": 91,
        "zh/en": 92,
        "zh/eng": 93,
        "zh/er": 94,
        "zh/f": 95,
        "zh/g": 96,
        "zh/h": 97,
        "zh/i": 98,
        "zh/i0": 99,
        "zh/ia": 100,
        "zh/ian": 101,
        "zh/iang": 102,
        "zh/iao": 103,
        "zh/ie": 104,
        "zh/in": 105,
        "zh/ing": 106,
        "zh/io": 107,
        "zh/iong": 108,
        "zh/ir": 109,
        "zh/iu": 110,
        "zh/j": 111,
        "zh/k": 112,
        "zh/l": 113,
        "zh/m": 114,
        "zh/n": 115,
        "zh/o": 116,
        "zh/ong": 117,
        "zh/ou": 118,
        "zh/p": 119,
        "zh/q": 120,
        "zh/r": 121,
        "zh/s": 122,
        "zh/sh": 123,
        "zh/t": 124,
        "zh/u": 125,
        "zh/ua": 126,
        "zh/uai": 127,
        "zh/uan": 128,
        "zh/uang": 129,
        "zh/ueng": 130,
        "zh/ui": 131,
        "zh/un": 132,
        "zh/uo": 133,
        "zh/v": 134,
        "zh/van": 135,
        "zh/ve": 136,
        "zh/vn": 137,
        "zh/w": 138,
        "zh/x": 139,
        "zh/y": 140,
        "zh/y0": 141,
        "zh/z": 142,
        "zh/zh": 143
    },
    "vocab_size": 144
}
